#Exp-3

In [ ]:
#Aim: Creating the Dataframe

In [1]:
#Name:Pratik Pravin Thorat
#Roll no.:76
#Subject:ET1
#Sec:B
#Date:07/08/2025

# Creating series

In [2]:
import pandas as pd

In [3]:
Name=["pratik","dev","vedant","shreyash","anand"]

In [4]:
Name

['pratik', 'dev', 'vedant', 'shreyash', 'anand']

In [5]:
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1      pratik
2         dev
3      vedant
4    shreyash
5       anand
dtype: object

# Creating Datab Frame

In [23]:
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],
               columns=["CD","DBMS","DSS","CAO"])

In [24]:
df

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15

In [8]:
df.shape

(3, 4)

In [9]:
df.size

12

In [10]:
df.ndim

2

# Adding Record (Row)to the data frame

In [30]:
df2=pd.DataFrame([[10,12,14,16]],
columns=["CD","DBMS","DSS","CAO"])

In [35]:
df3 = pd.concat([df, df2], ignore_index=True)

In [36]:
df3

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3  10    12   14   16

# Deleting Record from df3 dataframe

In [38]:
df4=df3.drop(index=[1])

In [39]:
df4

   CD  DBMS  DSS  CAO
0  10    12   14   16
2  12    13   14   15
3  10    12   14   16

# Adding Attribute (columns)to data frame

In [40]:
df3["DM"]=[11,22,33,44]

In [41]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  11
1  11    18   15   21  22
2  12    13   14   15  33
3  10    12   14   16  44

# Deleting attribut (columns) from df3 dataframe

In [42]:
df5=df3.drop(columns=["DM"])

In [43]:
df5

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3  10    12   14   16

In [44]:
print("mean of dss:",df5["DSS"].mean())

mean of dss: 14.25

In [45]:
print("median of dss:",df5["DSS"].median())

median of dss: 14.0

In [46]:
print("mode of dss:",df5["DSS"].mode())

mode of dss: 0    14
dtype: int64